app/controllers/entradas_controller.rb

SELECT `entradas`.* FROM `entradas`
---
  def index
    @entradas = Entrada.all