app/controllers/tipoplatos_controller.rb

SELECT `tipoplatos`.* FROM `tipoplatos`
---
  def index
    @tipoplatos = Tipoplato.all

INSERT INTO `tipoplatos` (`name`, `description`, `created_at`, `updated_at`) VALUES ('Entrada', 'Entrada del mneu', '2015-06-06 20:49:13', '2015-06-06 20:49:13')
---
  def create
    @tipoplato = Tipoplato.new(tipoplato_params)

    respond_to do |format|
      if @tipoplato.save

SELECT  `tipoplatos`.* FROM `tipoplatos` WHERE `tipoplatos`.`id` = 1 LIMIT 1
---
    def set_tipoplato
      @tipoplato = Tipoplato.find(params[:id])