app/controllers/tipomenus_controller.rb

SELECT `tipomenus`.* FROM `tipomenus`
---
  def index
    @tipomenus = Tipomenu.all

INSERT INTO `tipomenus` (`name`, `description`, `created_at`, `updated_at`) VALUES ('Parrillas', 'Menu carnes y parrillas', '2015-06-04 01:45:32', '2015-06-04 01:45:32')
---
  def create
    @tipomenu = Tipomenu.new(tipomenu_params)

    respond_to do |format|
      if @tipomenu.save

SELECT  `tipomenus`.* FROM `tipomenus` WHERE `tipomenus`.`id` = 1 LIMIT 1
---
    def set_tipomenu
      @tipomenu = Tipomenu.find(params[:id])